# classes
WARRIOR = 'воин'
MAGE = 'маг'
ARCHER = 'стрелок'

# preparing for the game​
GREETING = 'Добро пожаловать в тактическую игру на арене!'
NAME = 'Введите имя игрока'
PLAYER_CLASS = 'Выберите класс для'
CLASS_ERROR = 'Неверный класс. Выберите класс (Воин, Маг, Стрелок):'

# game process​
PLATERS_HEALTH = 'Текущие здоровья игроков:'
MOTION = 'ваш ход!'
ACTION = 'Выберите действие (1 - Атака, 2 - Использовать специальную способность, 3 - Исцеление):'
TARGET = 'Выберите игрока для атаки (1, 2 или 3):'
TARGET_ERROR = 'Вы не можете атаковать себя или мертвого игрока. Выберите другого.'
ATTACK = 'атакует'
DAMAGE = 'ранит на'
HEALING = 'исцеляет себя на'
HP = 'единиц здоровья'
SPECIAL_OPPORTUNITY = 'использует специальную способность'
ABILITY_TARGET = 'Выберите игрока для специальной способности (1, 2 или 3):'
ABILITY_ERROR = 'не может использовать специальную способность на себя!'
NO_ABILITY = 'уже использовал свою специальную способность!'
DEATH_MESSAGE = 'был повержен!'

# end of the game​
CONGRATULATION = 'Поздравляем! Игрок'
WINNER_MESSAGE = 'стал победителем с'

# others
CONJUNCTION = 'и'
